{
  "projects": [
    {
      "Project_Description": "Created an interactive, dynamic webpage using HTML, PHP and CSS which was linked to a backend database; allowing the user to perform actions (logging in, booking sessions, etc.). Implemented JavaScript functions to handle erroneous data entered by the user. Utilised tools such as: HeidiSQL to create a database based of the EERD, and Laragon to host the website on a local server.",
      "Project_Name": "COM1025 Coursework - Surrey Sports Park Database System",
      "Skills": ["HTML", "CSS", "Javascript", "PHP", "SQL"]
    },
    {
      "Project_Description": "Created an interactive, dynamic webpage using HTML, PHP and CSS which was linked to a backend database; allowing the user to perform actions (logging in, booking sessions, etc.). Implemented JavaScript functions to handle erroneous data entered by the user. Utilised tools such as: HeidiSQL to create a database based of the EERD, and Laragon to host the website on a local server.",
      "Project_Name": "COM1028 Coursework - Database Analytics System",
      "Skills": ["SQL", "Java"]
    },
    {
      "Project_Description": "Programmed a Morse Code Translator using a Raspberry Pi, using ARM assembly language. The program was able to detect button presses and map them to their corresponding letters, displaying their output to a 7-segment display and terminal. Built external circuitry using the GPIO pins on the Raspberry Pi and components (i.e., wires, breadboard, button and  segment display).",
      "Project_Name": "COM1031 Coursework - Morse Code Translator",
      "Skills": ["ARM Assembly"]
    },
    {
      "Project_Description": "Developed a segmented memory management system using Java which allocated and de-allocated groups of processes. The program allowed for the allocated processes to be dynamically resized, throwing the relevant exception if an error occurred.",
      "Project_Name": "COM1032 Coursework - Segmented Memory Manager",
      "Skills": ["Java"]
    },
    {
      "Project_Description": "Utilised Django framework to develop a user friendly, functional web application. Designed and put into effect a backend infrastructure (models, views, URLs), ensuring reliant data management. Enhanced user experience by programming views, enabling user actions such as album/song creation, viewing, editing and deletion. Implemented a login system, that also displayed infomation back to users about comments they made on each album in a list.",
      "Project_Name": "COM2025 Coursework - Django Web Application",
      "Skills": ["Django", "Python", "HTML", "CSS", "JavaScript"]
    },
    {
      "Project_Name": "COM2027 Coursework - Software Engineering Project",
      "Project_Description": "Created Project Workfox, a full stack web application which was functional and interactive. The purpose of the application was to further improve an employees retention and engagement, whilst working from home. Features that I implemented: a weather widget that allows the user to find the weather of location; maps & activities feature that shows activities around the user based on current weather; and a BeReal feature implemented using SSE (real time client streaming requirement).",
      "Skills": ["Django", "Python", "HTML", "JavaScript", "APIs"]
    },
    {
      "Project_Description": "Further developed the ResNet-18 Model (supplemented by PyTorch) to classify whether a breast ultrasound was cancerous or non-cancerous. Hyper-parameter tuning was performed: Epochs, learning rate, momentum, dropout probability, weight decay and batch size. Additional layers were also added to add randomness and to stop the model from remembering rather than learning. All these modifications aided in the increase in AUC and overall accuracy of the model.",
      "Project_Name": "COM2028 Coursework - Classification of Ultrasounds",
      "Skills": ["Scikit-Learn", "PyTorch", "Python"]
    },
    {
      "Project_Description": "Further developed my understanding on cryptography, coded solutions to solve cryptographic problems set. Used my programming and cryptographic knowledge to solve problems which utilised ciphers and other encryption schemes.",
      "Project_Name": "COM2041 Coursework 1 - Computer Security ",
      "Skills": ["Java"]
    },
    {
      "Project_Description": "Modelled transmissions using scyther to test their security, and see whether attackers were able to intercept it, and decode it.",
      "Project_Name": "COM2041 Coursework 2 - Computer Security",
      "Skills": ["Scyther"]
    }
  ],

  "Skills": [
    { "SkillName": "ARM Assembly" },
    { "SkillName": "C++" },
    { "SkillName": "C++ Cuda" },
    { "SkillName": "Java" },
    { "SkillName": "Python" },
    { "SkillName": "JavaScript" },
    { "SkillName": "CSS" },
    { "SkillName": "HTML" },
    { "SkillName": "Django" },
    { "SkillName": "PHP" },
    { "SkillName": "SQL" },
    { "SkillName": "React" },
    { "SkillName": "NextJS" },
    { "SkillName": "PyTorch" },
    { "SkillName": "Scikit-Learn" },
    { "SkillName": "Scyther" }
  ]
}
